## staging: rds
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 3 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                           NAME                            |
|--------|-----------------------------------------------------------|
| delete | `aws_cloudwatch_metric_alarm.high-db-cpu-critical[0]`     |
|        | `aws_cloudwatch_metric_alarm.high-db-cpu-critical[1]`     |
|        | `aws_cloudwatch_metric_alarm.high-db-cpu-critical[2]`     |
| update | `aws_cloudwatch_metric_alarm.high-db-cpu-warning[0]`      |
|        | `aws_cloudwatch_metric_alarm.high-db-cpu-warning[1]`      |
|        | `aws_cloudwatch_metric_alarm.high-db-cpu-warning[2]`      |
| add    | `aws_cloudwatch_metric_alarm.very-high-db-cpu-warning[0]` |
|        | `aws_cloudwatch_metric_alarm.very-high-db-cpu-warning[1]` |
|        | `aws_cloudwatch_metric_alarm.very-high-db-cpu-warning[2]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.high-db-cpu-critical[0] will be destroyed
  # (because aws_cloudwatch_metric_alarm.high-db-cpu-critical is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "high-db-cpu-critical" {
      - actions_enabled                       = true -> null
      - alarm_actions                         = [
          - "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ] -> null
      - alarm_description                     = "CPU usage of the RDS instance > 95%" -> null
      - alarm_name                            = "high-db-cpu-critical-instance-0" -> null
      - arn                                   = "arn:aws:cloudwatch:ca-central-1:239043911459:alarm:high-db-cpu-critical-instance-0" -> null
      - comparison_operator                   = "GreaterThanThreshold" -> null
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {
          - "DBInstanceIdentifier" = "notification-canada-ca-staging-instance-0"
        } -> null
      - evaluation_periods                    = 1 -> null
      - id                                    = "high-db-cpu-critical-instance-0" -> null
      - insufficient_data_actions             = [] -> null
      - metric_name                           = "CPUUtilization" -> null
      - namespace                             = "AWS/RDS" -> null
      - ok_actions                            = [] -> null
      - period                                = 60 -> null
      - statistic                             = "Average" -> null
      - tags                                  = {} -> null
      - tags_all                              = {} -> null
      - threshold                             = 95 -> null
      - treat_missing_data                    = "notBreaching" -> null
        # (4 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.high-db-cpu-critical[1] will be destroyed
  # (because aws_cloudwatch_metric_alarm.high-db-cpu-critical is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "high-db-cpu-critical" {
      - actions_enabled                       = true -> null
      - alarm_actions                         = [
          - "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ] -> null
      - alarm_description                     = "CPU usage of the RDS instance > 95%" -> null
      - alarm_name                            = "high-db-cpu-critical-instance-1" -> null
      - arn                                   = "arn:aws:cloudwatch:ca-central-1:239043911459:alarm:high-db-cpu-critical-instance-1" -> null
      - comparison_operator                   = "GreaterThanThreshold" -> null
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {
          - "DBInstanceIdentifier" = "notification-canada-ca-staging-instance-1"
        } -> null
      - evaluation_periods                    = 1 -> null
      - id                                    = "high-db-cpu-critical-instance-1" -> null
      - insufficient_data_actions             = [] -> null
      - metric_name                           = "CPUUtilization" -> null
      - namespace                             = "AWS/RDS" -> null
      - ok_actions                            = [] -> null
      - period                                = 60 -> null
      - statistic                             = "Average" -> null
      - tags                                  = {} -> null
      - tags_all                              = {} -> null
      - threshold                             = 95 -> null
      - treat_missing_data                    = "notBreaching" -> null
        # (4 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.high-db-cpu-critical[2] will be destroyed
  # (because aws_cloudwatch_metric_alarm.high-db-cpu-critical is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "high-db-cpu-critical" {
      - actions_enabled                       = true -> null
      - alarm_actions                         = [
          - "arn:aws:sns:ca-central-1:239043911459:alert-critical",
        ] -> null
      - alarm_description                     = "CPU usage of the RDS instance > 95%" -> null
      - alarm_name                            = "high-db-cpu-critical-instance-2" -> null
      - arn                                   = "arn:aws:cloudwatch:ca-central-1:239043911459:alarm:high-db-cpu-critical-instance-2" -> null
      - comparison_operator                   = "GreaterThanThreshold" -> null
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {
          - "DBInstanceIdentifier" = "notification-canada-ca-staging-instance-2"
        } -> null
      - evaluation_periods                    = 1 -> null
      - id                                    = "high-db-cpu-critical-instance-2" -> null
      - insufficient_data_actions             = [] -> null
      - metric_name                           = "CPUUtilization" -> null
      - namespace                             = "AWS/RDS" -> null
      - ok_actions                            = [] -> null
      - period                                = 60 -> null
      - statistic                             = "Average" -> null
      - tags                                  = {} -> null
      - tags_all                              = {} -> null
      - threshold                             = 95 -> null
      - treat_missing_data                    = "notBreaching" -> null
        # (4 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.high-db-cpu-warning[0] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "high-db-cpu-warning" {
      ~ alarm_description                     = "CPU usage of the RDS instance > 80%" -> "CPU usage of the RDS instance > 80% for 5 minutes"
      ~ datapoints_to_alarm                   = 0 -> 5
      ~ evaluation_periods                    = 1 -> 5
        id                                    = "high-db-cpu-warning-instance-0"
        tags                                  = {}
        # (19 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.high-db-cpu-warning[1] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "high-db-cpu-warning" {
      ~ alarm_description                     = "CPU usage of the RDS instance > 80%" -> "CPU usage of the RDS instance > 80% for 5 minutes"
      ~ datapoints_to_alarm                   = 0 -> 5
      ~ evaluation_periods                    = 1 -> 5
        id                                    = "high-db-cpu-warning-instance-1"
        tags                                  = {}
        # (19 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.high-db-cpu-warning[2] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "high-db-cpu-warning" {
      ~ alarm_description                     = "CPU usage of the RDS instance > 80%" -> "CPU usage of the RDS instance > 80% for 5 minutes"
      ~ datapoints_to_alarm                   = 0 -> 5
      ~ evaluation_periods                    = 1 -> 5
        id                                    = "high-db-cpu-warning-instance-2"
        tags                                  = {}
        # (19 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.very-high-db-cpu-warning[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "very-high-db-cpu-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "CPU usage of the RDS instance > 95% for 5 minutes"
      + alarm_name                            = "very-high-db-cpu-warning-instance-0"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 5
      + dimensions                            = {
          + "DBInstanceIdentifier" = "notification-canada-ca-staging-instance-0"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 5
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/RDS"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 95
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.very-high-db-cpu-warning[1] will be created
  + resource "aws_cloudwatch_metric_alarm" "very-high-db-cpu-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "CPU usage of the RDS instance > 95% for 5 minutes"
      + alarm_name                            = "very-high-db-cpu-warning-instance-1"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 5
      + dimensions                            = {
          + "DBInstanceIdentifier" = "notification-canada-ca-staging-instance-1"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 5
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/RDS"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 95
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.very-high-db-cpu-warning[2] will be created
  + resource "aws_cloudwatch_metric_alarm" "very-high-db-cpu-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "CPU usage of the RDS instance > 95% for 5 minutes"
      + alarm_name                            = "very-high-db-cpu-warning-instance-2"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 5
      + dimensions                            = {
          + "DBInstanceIdentifier" = "notification-canada-ca-staging-instance-2"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 5
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/RDS"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 95
      + treat_missing_data                    = "notBreaching"
    }

Plan: 3 to add, 3 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.logs_exports"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.db-free-local-storage-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.db-free-local-storage-critical[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.db-free-local-storage-critical[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.db-free-local-storage-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.db-free-local-storage-warning[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.db-free-local-storage-warning[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.high-db-cpu-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.high-db-cpu-warning[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.high-db-cpu-warning[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.high-dbload-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.high-dbload-critical[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.high-dbload-critical[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.high-dbload-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.high-dbload-warning[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.high-dbload-warning[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.low-db-memory-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.low-db-memory-critical[1]"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
